{
  "\n": 11, 
  " ": 0, 
  "!": 24, 
  "\"": 50, 
  "#": 81, 
  "$": 62, 
  "%": 104, 
  "&": 41, 
  "'": 39, 
  "(": 54, 
  ")": 44, 
  "*": 78, 
  "+": 91, 
  ",": 30, 
  "-": 40, 
  ".": 19, 
  "/": 51, 
  "0": 48, 
  "1": 49, 
  "2": 53, 
  "3": 56, 
  "4": 75, 
  "5": 68, 
  "6": 82, 
  "7": 73, 
  "8": 77, 
  "9": 63, 
  ":": 46, 
  ";": 57, 
  "<": 67, 
  "=": 94, 
  ">": 112, 
  "?": 60, 
  "@": 87, 
  "A": 36, 
  "B": 70, 
  "C": 55, 
  "D": 71, 
  "E": 61, 
  "F": 76, 
  "G": 83, 
  "H": 69, 
  "I": 45, 
  "J": 96, 
  "K": 95, 
  "L": 79, 
  "M": 37, 
  "N": 74, 
  "O": 52, 
  "P": 31, 
  "Q": 142, 
  "R": 58, 
  "S": 27, 
  "T": 28, 
  "U": 72, 
  "V": 85, 
  "W": 29, 
  "X": 110, 
  "Y": 26, 
  "[": 120, 
  "\\": 117, 
  "]": 114, 
  "_": 88, 
  "a": 3, 
  "b": 23, 
  "c": 21, 
  "d": 14, 
  "e": 1, 
  "f": 16, 
  "g": 15, 
  "h": 9, 
  "i": 7, 
  "j": 34, 
  "k": 25, 
  "l": 13, 
  "m": 17, 
  "n": 6, 
  "o": 2, 
  "p": 18, 
  "q": 43, 
  "r": 4, 
  "s": 8, 
  "t": 5, 
  "u": 10, 
  "v": 22, 
  "w": 20, 
  "x": 32, 
  "y": 12, 
  "z": 33, 
  "|": 106, 
  "~": 80, 
  "\u00a3": 124, 
  "\u00a5": 132, 
  "\u00e1": 135, 
  "\u00e9": 107, 
  "\u00ed": 136, 
  "\u00f0": 98, 
  "\u0160": 122, 
  "\u0178": 99, 
  "\u02dc": 111, 
  "\u0621": 141, 
  "\u0625": 138, 
  "\u0627": 115, 
  "\u0633": 125, 
  "\u0634": 133, 
  "\u0644": 113, 
  "\u0645": 129, 
  "\u0646": 140, 
  "\u0647": 126, 
  "\u064e": 123, 
  "\u0650": 143, 
  "\u0652": 144, 
  "\u200d": 97, 
  "\u2013": 84, 
  "\u2014": 66, 
  "\u2018": 90, 
  "\u2019": 42, 
  "\u201c": 65, 
  "\u201d": 64, 
  "\u201e": 131, 
  "\u2026": 93, 
  "\u2063": 128, 
  "\u20ac": 127, 
  "\u2604": 116, 
  "\u2609": 109, 
  "\u2618": 118, 
  "\u261d": 139, 
  "\u2627": 134, 
  "\u263a": 102, 
  "\u2640": 108, 
  "\u2642": 137, 
  "\u2661": 59, 
  "\u2665": 47, 
  "\u2698": 119, 
  "\u270a": 105, 
  "\u270c": 92, 
  "\u271d": 100, 
  "\u2728": 89, 
  "\u274c": 103, 
  "\u2763": 86, 
  "\u2764": 35, 
  "\u2b50": 121, 
  "\u2b55": 101, 
  "\ufe0e": 130, 
  "\ufe0f": 38
}